      * level 01
           move "Bd-File-Record" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Bd-File-Record to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Custid-Key" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Bd-Custid-Key to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Bd-Custid" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Bd-Custid to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Bd-Key" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Bd-Key to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 04
           move "Bd-Ordno" to f-name.
           move "zzzzz9" to f-t4.
           move spaces to f-t5.
           move length Bd-Ordno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 04
           move "Bd-Bill-Custid" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Bd-Bill-Custid to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 04
           move "Bd-Ref" to f-name.
           move "9999" to f-t4.
           move spaces to f-t5.
           move length Bd-Ref to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Ag-Id" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Bd-Ag-Id to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Type" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Bd-Type to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Cust-Name" to f-name.
           move "x(36)" to f-t4.
           move spaces to f-t5.
           move length Bd-Cust-Name to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Addr1" to f-name.
           move "x(36)" to f-t4.
           move spaces to f-t5.
           move length Bd-Addr1 to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Addr2" to f-name.
           move "x(36)" to f-t4.
           move spaces to f-t5.
           move length Bd-Addr2 to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-City" to f-name.
           move "x(18)" to f-t4.
           move spaces to f-t5.
           move length Bd-City to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-State" to f-name.
           move "x(2)" to f-t4.
           move spaces to f-t5.
           move length Bd-State to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Zip" to f-name.
           move "x(10)" to f-t4.
           move spaces to f-t5.
           move length Bd-Zip to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Confirmation" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Bd-Confirmation to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Affidavit" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Bd-Affidavit to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Statement" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Bd-Statement to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Bsta" to f-name.
           move "9" to f-t4.
           move spaces to f-t5.
           move length Bd-Bsta to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Glkey" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Bd-Glkey to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Fixed-Amount" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Bd-Fixed-Amount to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Bd-Percent" to f-name.
           move "s9(3)v9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Bd-Percent to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

