      * level 01
           move "Order-Detail" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Order-Detail to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Custid" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Od-Custid to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Key" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Od-Key to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Od-Ordno" to f-name.
           move "zzzzz9" to f-t4.
           move spaces to f-t5.
           move length Od-Ordno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Od-Detno" to f-name.
           move "99" to f-t4.
           move spaces to f-t5.
           move length Od-Detno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Ordtype" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Ordtype to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Bdesc" to f-name.
           move "x(20)" to f-t4.
           move spaces to f-t5.
           move length Od-Bdesc to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Urate" to f-name.
           move "s9(5)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Urate to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Startd" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Startd to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Endd" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Endd to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Stime" to f-name.
           move "s9(5)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Stime to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Etime" to f-name.
           move "s9(5)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Etime to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Atime" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Od-Atime to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Logsta" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Od-Logsta to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Prdcode" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Prdcode to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Pri" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Od-Pri to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Cart" to f-name.
           move "x(4)" to f-t4.
           move spaces to f-t5.
           move length Od-Cart to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Length" to f-name.
           move "s9(5)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Length to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Type" to f-name.
           move "x(4)" to f-t4.
           move spaces to f-t5.
           move length Od-Type to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Wkday-Tbl" to f-name.
           move "OCCURS(7)" to f-t4.
           move spaces to f-t5.
           move 0 to f-flen flen f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Od-Wkday" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Wkday to len.
           multiply 0007 by len.
           move len to f-flen flen.
           move 0 to f-clen.
           move 0 to f-elements.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Altcode" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Od-Altcode to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Startg" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Startg to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Endg" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Endg to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Curranns" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Curranns to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Nextanns" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Nextanns to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Totanns" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Totanns to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Curramt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Curramt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Nextamt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Nextamt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Totamt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Totamt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Ahs" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Od-Ahs to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Hspots" to f-name.
           move "9(3)" to f-t4.
           move spaces to f-t5.
           move length Od-Hspots to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Hwkday-Tbl" to f-name.
           move "OCCURS(7)" to f-t4.
           move spaces to f-t5.
           move 0 to f-flen flen f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Od-Hwkday" to f-name.
           move "9" to f-t4.
           move spaces to f-t5.
           move length Od-Hwkday to len.
           multiply 0007 by len.
           move len to f-flen flen.
           move 0 to f-clen.
           move 0 to f-elements.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Tal-No" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Od-Tal-No to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Tal-Per" to f-name.
           move "s9(2)v9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Tal-Per to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Tal-Amt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Od-Tal-Amt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Hsflag" to f-name.
           move "x(1)" to f-t4.
           move spaces to f-t5.
           move length Od-Hsflag to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Group" to f-name.
           move "9(4)" to f-t4.
           move spaces to f-t5.
           move length Od-Group to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Od-Inst" to f-name.
           move "x(45)" to f-t4.
           move spaces to f-t5.
           move length Od-Inst to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

