      * level 01
           move "Order-Header" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Order-Header to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Custid" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Oh-Custid to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Key" to f-name.
           move spaces to f-t4.
           move spaces to f-t5.
           move length Oh-Key to len.
           move len to f-clen.
           move 0 to f-flen flen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Oh-Ordno" to f-name.
           move "zzzzz9" to f-t4.
           move spaces to f-t5.
           move length Oh-Ordno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 03
           move "Oh-Detno" to f-name.
           move "99" to f-t4.
           move spaces to f-t5.
           move length Oh-Detno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Cust-Name" to f-name.
           move "x(26)" to f-t4.
           move spaces to f-t5.
           move length Oh-Cust-Name to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Coop" to f-name.
           move "x(20)" to f-t4.
           move spaces to f-t5.
           move length Oh-Coop to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Pkgprice" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Pkgprice to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Sba" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Sba to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Glkey" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Glkey to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Sp" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Sp to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Spcomm" to f-name.
           move "s9(2)v9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Spcomm to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Agyno" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Agyno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Agycomm" to f-name.
           move "s9(2)v9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Agycomm to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Agygl" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Agygl to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Repno" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Repno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Repcomm" to f-name.
           move "s9(2)v9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Repcomm to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Repgl" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Repgl to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Cycle" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Cycle to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Type" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Type to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Intcode" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Intcode to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Bsta" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Bsta to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Class" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Class to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Affd" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Affd to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Curramt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Curramt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Nextamt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Nextamt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Totamt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Totamt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-To-Date-Amt" to f-name.
           move "s9(7)v9(2)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-To-Date-Amt to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Update-Code" to f-name.
           move "s9(3)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Update-Code to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Exp-Date" to f-name.
           move "s9(7)" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Exp-Date to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Next-Det" to f-name.
           move "9(2)" to f-t4.
           move spaces to f-t5.
           move length Oh-Next-Det to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Sales-Tax-State" to f-name.
           move "99" to f-t4.
           move "COMP-3" to f-t5.
           move length Oh-Sales-Tax-State to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Bcode" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Bcode to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Invno" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Oh-Invno to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Bfrom" to f-name.
           move "9(1)" to f-t4.
           move spaces to f-t5.
           move length Oh-Bfrom to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Ag-Id" to f-name.
           move "x(6)" to f-t4.
           move spaces to f-t5.
           move length Oh-Ag-Id to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Bc-Cont-No" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Oh-Bc-Cont-No to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Inv-Group" to f-name.
           move "x" to f-t4.
           move spaces to f-t5.
           move length Oh-Inv-Group to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "fn001" to f-name.
           move "x(5)" to f-t4.
           move spaces to f-t5.
           move length fn001 to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

      * level 02
           move "Oh-Inst" to f-name.
           move "x(45)" to f-t4.
           move spaces to f-t5.
           move length Oh-Inst to len.
           move len to f-flen flen.
           move 0 to f-clen.
           move rl-pos to f-pos.
           perform Write-Rl.
           add flen to rl-pos.

